from flask import Flask

# ==================================================
# インスタンス生成
# ==================================================
app = Flask(__name__)

# ==================================================
# ルーティング
# ==================================================
@app.route('/')
def show_user_info():
    data_dict = {
        "name": "太郎",
        "age": 33 
    }
    data = data_dict["name"] + " : " + str(data_dict["age"])
    return data

# ==================================================
# 実行
# ==================================================
if __name__ == '__main__':
    # デバッグモードを有効化
    app.run(debug=True)